[
  {
    "title": "Software Engineer",
    "period": "October 2021 - January 2023",
    "company": {
      "name": "WALDO",
      "location": "UNITED STATES",
      "website": "https://www.waldo.fyi"
    },
    "location": "REMOTELY IN BLUMENAU/SC - BRAZIL",
    "description": [
      "• Helped the team creating and improving a search engine tool;",
      "• Implemented E2E and Unit Tests to make sure we had a good percentage of test coverage on front end and back end;",
      "• Helped improve the NLP service using Spacy and Python."
    ],
    "tools": "TypeScript (NodeJS and ReactJS), NextJS, MaterialUI 5, Python, Poetry, Spacy, PostgreSQL, Prisma, Jest, Storybook, Sentry, SonarQube, Docker, CircleCI, Vercel, Datadog, AWS, Shortcut, Figma, Notion, Github.",
    "last": "false"
  },
  {
    "title": "Specialist Developer",
    "period": "April 2021 - September 2021",
    "company": {
      "name": "ZOOP",
      "location": "RIO DE JANEIRO/RJ - BRAZIL",
      "website": "https://zoop.com.br"
    },
    "location": "REMOTELY IN SÃO PAULO/SP - BRAZIL",
    "description": [
      "• I created an initiative to restructure the backend applications;",
      "• Implemented an auto scale policy based on memory usage in AWS for some applications to reduce costs and improve performance."
    ],
    "tools": "JavaScript (NodeJS and ReactJS), Python, ExpressJS, MongoDB, Elasticsearch, MySQL, Docker, Jenkins, Kibana, Graylog, Datadog, AWS, Terraform, Jira, Figma, Github.",
    "last": "false"
  },
  {
    "title": "Back end Developer",
    "period": "March 2020 - April 2021",
    "company": {
      "name": "MAITHA TECH (Cobasi - Pet Shop)",
      "location": "RIO DE JANEIRO/RJ - BRAZIL",
      "website": "https://maitha.com.br"
    },
    "location": "REMOTELY IN SÃO PAULO/SP - BRAZIL",
    "description": [
      "• I helped bootstrap the Ecommerce Customer Services Team and single handedly Customer Services and Logistics Assistance process automation using Rest APIs and Messaging Services as micro services;",
      "• I have set up the Whatsapp API and built a chatbot for Customer Services;",
      "• Deployed applications using Docker Compose and Bitbucket pipelines in servers hosted at Azure."
    ],
    "tools": "JavaScript (NodeJS and ReactJS), Python, ExpressJS, Jest, Supertest, Nock, Sequelize, KafkaJS, Knex, Swagger, SQL Server, MongoDB, Kafka, Figma, Docker, Azure, Jira, Bitbucket.",
    "last": "false"
  },
  {
    "title": "Full stack Developer",
    "period": "August 2019 - March 2020",
    "company": {
      "name": "GAIVOTA",
      "location": "SÃO PAULO/SP - BRAZIL",
      "website": "https://gaivota.ai"
    },
    "location": "ON SITE",
    "description": [
      "• On a daily basis I helped the team creating new features and fixing bugs on frontend and backend applications;",
      "• I helped migrate our monolithic system into micro services. Some of them became APIs, others were transformed into messaging services."
    ],
    "tools": "JavaScript (NodeJS, ReactJS and React Native), ExpressJS, Knex, Cypress, Jest, RabbitMQ, Python, Docker, Consul, Jenkins, Kibana, Consul, Figma, AirFlow, AWS S3, QGIS, MySQL, VSCode, Github.",
    "last": "false"
  },
  {
    "title": "Full stack Developer",
    "period": "August 2018 - August 2019",
    "company": {
      "name": "WK SISTEMAS",
      "location": "BLUMENAU/SC - BRAZIL",
      "website": "https://wk.com.br"
    },
    "location": "ON SITE",
    "description": [
      "• On a daily basis I helped the team creating new features and fixing bugs on a PWA app using ReactJS;",
      "• I created a BFF API for our PWA app using dotnet and dotnet-graphql."
    ],
    "tools": "JavaScript (ReactJS), NPM, Yarn, PWA, HTML, CSS, Firebase, Figma, C#, GraphQL-Dotnet, Entity Framework, Visual Studio, SQL, Server, Github, IIS and Windows.",
    "last": "false"
  },
  {
    "title": "Python Developer and Test Analyst",
    "period": "December 2015 - August 2018",
    "company": {
      "name": "LINX SISTEMAS",
      "location": "BLUMENAU/SC - BRAZIL",
      "website": "https://www.linx.com.br"
    },
    "location": "ON SITE",
    "description": [
      "Aug 2017 - Aug 2018 | Python Developer",
      "• I worked in the sustainability team fixing bugs to make sure we had a stable version and implemented small features from time to time.",
      "Dec 2015 - Aug 2017 | Test Analyst",
      "• I started as a Technical Writer and after 3 months I became a Test Analyst;",
      "Used TestLink to create test scripts;",
      "Tests executed: Interface, Regression, Acceptance and Database."
    ],
    "tools": "Python, Glade, PostgreSQL, CVS, TestLink.",
    "last": "true"
  }
]
